
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");

КонецПроцедуры    

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда 
	СтандартнаяОбработка = Ложь;	
	Представление =  Данные.Наименование + " " + СтрШаблон("Действует на основании %1",Данные.ДействуетНаОсновании);
	
	КонецЕсли;
КонецПроцедуры

